{"config": [{"config": {"init": "glorot_uniform", "activity_regularizer": null, "batch_input_shape": [null, 100, 100, 3], "nb_filter": 32, "W_constraint": null, "W_regularizer": null, "trainable": true, "nb_row": 3, "input_dtype": "float32", "b_regularizer": null, "subsample": [1, 1], "nb_col": 3, "dim_ordering": "tf", "b_constraint": null, "border_mode": "valid", "bias": true, "name": "convolution2d_1", "activation": "elu"}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_1", "dim_ordering": "tf", "border_mode": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"init": "glorot_uniform", "activity_regularizer": null, "nb_filter": 32, "W_constraint": null, "W_regularizer": null, "trainable": true, "nb_row": 3, "b_regularizer": null, "subsample": [1, 1], "nb_col": 3, "dim_ordering": "tf", "b_constraint": null, "border_mode": "valid", "bias": true, "name": "convolution2d_2", "activation": "elu"}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_2", "dim_ordering": "tf", "border_mode": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"init": "glorot_uniform", "activity_regularizer": null, "nb_filter": 32, "W_constraint": null, "W_regularizer": null, "trainable": true, "nb_row": 3, "b_regularizer": null, "subsample": [1, 1], "nb_col": 3, "dim_ordering": "tf", "b_constraint": null, "border_mode": "valid", "bias": true, "name": "convolution2d_3", "activation": "elu"}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_3", "dim_ordering": "tf", "border_mode": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"init": "glorot_uniform", "activity_regularizer": null, "nb_filter": 64, "W_constraint": null, "W_regularizer": null, "trainable": true, "nb_row": 3, "b_regularizer": null, "subsample": [1, 1], "nb_col": 3, "dim_ordering": "tf", "b_constraint": null, "border_mode": "valid", "bias": true, "name": "convolution2d_4", "activation": "elu"}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_4", "dim_ordering": "tf", "border_mode": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"init": "glorot_uniform", "activity_regularizer": null, "nb_filter": 128, "W_constraint": null, "W_regularizer": null, "trainable": true, "nb_row": 3, "b_regularizer": null, "subsample": [1, 1], "nb_col": 3, "dim_ordering": "tf", "b_constraint": null, "border_mode": "valid", "bias": true, "name": "convolution2d_5", "activation": "elu"}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_5", "dim_ordering": "tf", "border_mode": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"output_dim": 1024, "activity_regularizer": null, "activation": "elu", "W_constraint": null, "W_regularizer": null, "trainable": true, "b_regularizer": null, "name": "dense_1", "input_dim": null, "b_constraint": null, "bias": true, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"output_dim": 512, "activity_regularizer": null, "activation": "elu", "W_constraint": null, "W_regularizer": null, "trainable": true, "b_regularizer": null, "name": "dense_2", "input_dim": null, "b_constraint": null, "bias": true, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"output_dim": 1, "activity_regularizer": null, "activation": "linear", "W_constraint": null, "W_regularizer": null, "trainable": true, "b_regularizer": null, "name": "dense_3", "input_dim": null, "b_constraint": null, "bias": true, "init": "glorot_uniform"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.1"}