{"keras_version": "1.1.1", "config": [{"config": {"subsample": [1, 1], "trainable": true, "nb_filter": 32, "nb_row": 3, "nb_col": 3, "border_mode": "valid", "batch_input_shape": [null, 100, 100, 3], "bias": true, "activity_regularizer": null, "b_regularizer": null, "activation": "elu", "name": "convolution2d_11", "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "dim_ordering": "tf", "input_dtype": "float32"}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "pool_size": [2, 2], "trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_11", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"subsample": [1, 1], "init": "glorot_uniform", "nb_filter": 32, "nb_row": 3, "nb_col": 3, "border_mode": "valid", "trainable": true, "activity_regularizer": null, "bias": true, "b_regularizer": null, "name": "convolution2d_12", "b_constraint": null, "W_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "activation": "elu"}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "pool_size": [2, 2], "trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_12", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"subsample": [1, 1], "init": "glorot_uniform", "nb_filter": 32, "nb_row": 3, "nb_col": 3, "border_mode": "valid", "trainable": true, "activity_regularizer": null, "bias": true, "b_regularizer": null, "name": "convolution2d_13", "b_constraint": null, "W_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "activation": "elu"}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "pool_size": [2, 2], "trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_13", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"subsample": [1, 1], "init": "glorot_uniform", "nb_filter": 64, "nb_row": 3, "nb_col": 3, "border_mode": "valid", "trainable": true, "activity_regularizer": null, "bias": true, "b_regularizer": null, "name": "convolution2d_14", "b_constraint": null, "W_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "activation": "elu"}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "pool_size": [2, 2], "trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_14", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"subsample": [1, 1], "init": "glorot_uniform", "nb_filter": 128, "nb_row": 3, "nb_col": 3, "border_mode": "valid", "trainable": true, "activity_regularizer": null, "bias": true, "b_regularizer": null, "name": "convolution2d_15", "b_constraint": null, "W_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "activation": "elu"}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "pool_size": [2, 2], "trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_15", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_3", "trainable": true}, "class_name": "Flatten"}, {"config": {"init": "glorot_uniform", "output_dim": 1024, "W_constraint": null, "trainable": true, "activity_regularizer": null, "bias": true, "b_regularizer": null, "name": "dense_7", "b_constraint": null, "W_regularizer": null, "input_dim": null, "activation": "elu"}, "class_name": "Dense"}, {"config": {"name": "dropout_5", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "output_dim": 512, "W_constraint": null, "trainable": true, "activity_regularizer": null, "bias": true, "b_regularizer": null, "name": "dense_8", "b_constraint": null, "W_regularizer": null, "input_dim": null, "activation": "elu"}, "class_name": "Dense"}, {"config": {"name": "dropout_6", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "output_dim": 1, "W_constraint": null, "trainable": true, "activity_regularizer": null, "bias": true, "b_regularizer": null, "name": "dense_9", "b_constraint": null, "W_regularizer": null, "input_dim": null, "activation": "linear"}, "class_name": "Dense"}], "class_name": "Sequential"}