{"keras_version": "1.1.1", "config": [{"config": {"b_regularizer": null, "bias": true, "input_dtype": "float32", "dim_ordering": "tf", "subsample": [1, 1], "batch_input_shape": [null, 64, 64, 3], "activation": "elu", "border_mode": "valid", "W_regularizer": null, "trainable": true, "nb_row": 5, "name": "convolution2d_1", "W_constraint": null, "nb_col": 5, "init": "glorot_uniform", "b_constraint": null, "nb_filter": 32, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_1", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"b_regularizer": null, "bias": true, "dim_ordering": "tf", "subsample": [1, 1], "activation": "elu", "border_mode": "valid", "W_regularizer": null, "trainable": true, "nb_row": 5, "name": "convolution2d_2", "W_constraint": null, "nb_col": 5, "init": "glorot_uniform", "b_constraint": null, "nb_filter": 32, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_2", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"b_regularizer": null, "bias": true, "dim_ordering": "tf", "subsample": [1, 1], "activation": "elu", "border_mode": "valid", "W_regularizer": null, "trainable": true, "nb_row": 5, "name": "convolution2d_3", "W_constraint": null, "nb_col": 5, "init": "glorot_uniform", "b_constraint": null, "nb_filter": 32, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_3", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"b_regularizer": null, "bias": true, "dim_ordering": "tf", "subsample": [1, 1], "activation": "elu", "border_mode": "valid", "W_regularizer": null, "trainable": true, "nb_row": 3, "name": "convolution2d_4", "W_constraint": null, "nb_col": 3, "init": "glorot_uniform", "b_constraint": null, "nb_filter": 64, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_4", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}, {"config": {"b_regularizer": null, "bias": true, "activation": "elu", "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "output_dim": 1024, "W_constraint": null, "input_dim": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"b_regularizer": null, "bias": true, "activation": "elu", "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "output_dim": 512, "W_constraint": null, "input_dim": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"b_regularizer": null, "bias": true, "activation": "elu", "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "output_dim": 64, "W_constraint": null, "input_dim": null, "b_constraint": null, "name": "dense_3", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"b_regularizer": null, "bias": true, "activation": "elu", "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "output_dim": 10, "W_constraint": null, "input_dim": null, "b_constraint": null, "name": "dense_4", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"b_regularizer": null, "bias": true, "activation": "linear", "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "output_dim": 1, "W_constraint": null, "input_dim": null, "b_constraint": null, "name": "dense_5", "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}